# GetRevitElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExternalServiceUIData..::..GetRevitElementIds Method
IFCExternalServiceUIData Class See Also
---
return the list of revit Element Ids
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<ElementId> GetRevitElementIds()
```

Visual Basic
---
```text
Public Function GetRevitElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetRevitElementIds()
```

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace